In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

# Vectorized String Operations

In [2]:
ar = np.array([1,2,3,4,5])
ar*4 # vectorized operation.

array([ 4,  8, 12, 16, 20])

In [3]:
str = ['cat','mat',None,'rat']

In [6]:
[i.startwith('c') for i in str]

AttributeError: 'str' object has no attribute 'startwith'

In [9]:
# How pandas solves this issue?
my_series = pd.Series(['cat','mat',None,'rat'])

# String Accessor
my_series.str.startswith('c')

# Fast and optimized

0     True
1    False
2     None
3    False
dtype: object

In [10]:
titanic_data = pd.read_csv(r"C:\Users\sasha\Desktop\Python\Statistics\DataSet\titanic.csv")
titanic_data.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [11]:
titanic_data['Name']

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Name, Length: 891, dtype: object

In [12]:
titanic_data['Name'].str.lower()

0                                braund, mr. owen harris
1      cumings, mrs. john bradley (florence briggs th...
2                                 heikkinen, miss. laina
3           futrelle, mrs. jacques heath (lily may peel)
4                               allen, mr. william henry
                             ...
886                                montvila, rev. juozas
887                         graham, miss. margaret edith
888             johnston, miss. catherine helen "carrie"
889                                behr, mr. karl howell
890                                  dooley, mr. patrick
Name: Name, Length: 891, dtype: object

In [13]:
titanic_data['Name'].str.upper()

0                                BRAUND, MR. OWEN HARRIS
1      CUMINGS, MRS. JOHN BRADLEY (FLORENCE BRIGGS TH...
2                                 HEIKKINEN, MISS. LAINA
3           FUTRELLE, MRS. JACQUES HEATH (LILY MAY PEEL)
4                               ALLEN, MR. WILLIAM HENRY
                             ...
886                                MONTVILA, REV. JUOZAS
887                         GRAHAM, MISS. MARGARET EDITH
888             JOHNSTON, MISS. CATHERINE HELEN "CARRIE"
889                                BEHR, MR. KARL HOWELL
890                                  DOOLEY, MR. PATRICK
Name: Name, Length: 891, dtype: object

In [14]:
titanic_data['Name'].str.capitalize()

0                                Braund, mr. owen harris
1      Cumings, mrs. john bradley (florence briggs th...
2                                 Heikkinen, miss. laina
3           Futrelle, mrs. jacques heath (lily may peel)
4                               Allen, mr. william henry
                             ...
886                                Montvila, rev. juozas
887                         Graham, miss. margaret edith
888             Johnston, miss. catherine helen "carrie"
889                                Behr, mr. karl howell
890                                  Dooley, mr. patrick
Name: Name, Length: 891, dtype: object

In [15]:
titanic_data['Name'].str.title()

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Name, Length: 891, dtype: object

In [17]:
# len -- find maxi len of str in the series
# titanic_data["Name"][titanic_data["Name"].str.len().sort_values(ascending = False).head(1)].values[0]
titanic_data['Name'][titanic_data['Name'].str.len()==82].values[0]

'Penasco y Castellana, Mrs. Victor de Satode (Maria Josefa Perez de Soto y Vallejo)'

In [18]:
# strip() -- It will remove all the leading and trailing spaces.
"               sahil          ".strip()

titanic_data['Name'].str.strip()

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Name, Length: 891, dtype: object

In [21]:
# Split 
titanic_data["Last Name"]= titanic_data["Name"].str.split(',').str.get(0)
titanic_data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Last Name
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,Braund
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,Cumings
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Heikkinen
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,Futrelle
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,Allen
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,Montvila
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,Graham
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,Johnston
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,Behr
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,Dooley

In [22]:
# here n = 1 means ek hi split hoga ek se jada split nhi hoga.
titanic_data[['Title','First Name']]= titanic_data["Name"].str.split(',').str.get(1).str.strip().str.split(" ",n=1,expand=True)
titanic_data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Last Name,Title,First Name
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,Braund,Mr.,Owen Harris
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,Cumings,Mrs.,John Bradley (Florence Briggs Thayer)
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Heikkinen,Miss.,Laina
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,Futrelle,Mrs.,Jacques Heath (Lily May Peel)
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,Allen,Mr.,William Henry
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,Montvila,Rev.,Juozas
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,Graham,Miss.,Margaret Edith
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,Johnston,Miss.,"Catherine Helen ""Carrie"""
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,Behr,Mr.,Karl Howell
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,Dooley,Mr.,Patrick

In [ ]:
titanic_data['Title'].value_counts()

In [ ]:
# Replace
titanic_data['Title']= titanic_data['Title'].str.replace('Ms.','Miss.')
titanic_data['Title']= titanic_data['Title'].str.replace('Mlle.','Miss.')

In [ ]:
titanic_data['Title'].value_counts()

In [ ]:
# Filtering 
titanic_data[titanic_data['First Name'].str.startswith('A')]
titanic_data[titanic_data['First Name'].str.endswith('A')]

In [ ]:
titanic_data[titanic_data['First Name'].str.isdigit()]

In [ ]:
# applying regex
# contains
# search john -> both case

In [ ]:
titanic_data[titanic_data['First Name'].str.contains('john',case=False)]

In [ ]:
# First Name start and ends with vowel.
titanic_data[titanic_data['Last Name'].str.contains('^[aeiouAEIOU].+[aeiouAEIOU]$',case=False)]

In [ ]:
titanic_data[titanic_data['Last Name'].str.contains('^[^aeiouAEIOU].+[^aeiouAEIOU]$',case=False)]

# Slicing

In [ ]:
titanic_data['Name'].str[:6]

In [ ]:
titanic_data['Name'].str[::-1]

# PANDAS DATETIME CONCEPTS AND FUNC

Timestamp Object

Time stamps reference particular moments in time (e.g., Oct 24th, 2022 at 7:00pm)

In [27]:
# creating a timestamp  -- yyyy-mm-dd

print(pd.Timestamp('2022/09/23'))

print(type(pd.Timestamp('2022/09/23')))

print(pd.Timestamp('2022-09-23'))

2022-09-23 00:00:00
<class 'pandas._libs.tslibs.timestamps.Timestamp'>
2022-09-23 00:00:00

In [28]:
# only year
print(pd.Timestamp('2022'))
# only text
pd.Timestamp('5th January 2022')

2022-01-01 00:00:00

Timestamp('2022-01-05 00:00:00')

In [29]:
# Providing Time also 
pd.Timestamp('5th January 2022 12:21')

Timestamp('2022-01-05 12:21:00')

In [30]:
pd.Timestamp('2022, 05, 01, 12:55')

Timestamp('2022-05-01 12:55:00')

In [38]:
import datetime as dt

print(dt.datetime(2023, 3, 23))
print(type(dt.datetime(2023, 3, 23)))
print("===============================")
x = pd.Timestamp(dt.datetime(2023, 3, 23))
print(type(x))
print(x)

2023-03-23 00:00:00
<class 'datetime.datetime'>
===============================
<class 'pandas._libs.tslibs.timestamps.Timestamp'>
2023-03-23 00:00:00

In [34]:
# fetching attribute
print(x.year)
print(x.month)
print(x.day)
print(x.hour)
print(x.minute)
print(x.second)

2023
3
23
0
0
0

In [ ]:
# why separate objects to handle data and time when python already has datetime functionality?

# syntax wise datetime is very convenient
# But the performance takes a hit while working with huge data. List vs Numpy Array
# The weaknesses of Python's datetime format inspired the NumPy team to add a set of native time series data type to NumPy.
# The datetime64 dtype encodes dates as 64-bit integers, and thus allows arrays of dates to be represented very compactly.

In [39]:
date = np.array('2022-03-09', dtype = np.datetime64)
date

array('2022-03-09', dtype='datetime64[D]')

In [40]:
date+np.arange(12)

array(['2022-03-09', '2022-03-10', '2022-03-11', '2022-03-12',
       '2022-03-13', '2022-03-14', '2022-03-15', '2022-03-16',
       '2022-03-17', '2022-03-18', '2022-03-19', '2022-03-20'],
      dtype='datetime64[D]')

Because of the uniform type in NumPy datetime64 arrays, this type of operation can be accomplished much more quickly than if we were working directly with Python's datetime objects, especially as arrays get large

Pandas Timestamp object combines the ease-of-use of python datetime with the efficient storage and vectorized interface of numpy.datetime64

From a group of these Timestamp objects, Pandas can construct a DatetimeIndex that can be used to index data in a Series or DataFrame

# DateTime Index Object

A collection of pandas timestamp. When we have to store the multiple time value then will use Datetime Index object

DatetimeIndex Object means its a collection of timestamp.

In [41]:
pd.DatetimeIndex(['2022-01-01','2022-02-01','2022-03-01'])

DatetimeIndex(['2022-01-01', '2022-02-01', '2022-03-01'], dtype='datetime64[ns]', freq=None)

In [42]:
type(pd.DatetimeIndex(['2022-01-01','2022-02-01','2022-03-01'])[0])

pandas._libs.tslibs.timestamps.Timestamp

In [43]:
type(pd.DatetimeIndex(['2022-01-01','2022-02-01','2022-03-01']))

pandas.core.indexes.datetimes.DatetimeIndex

In [44]:
# using python Datetime object.
pd.DatetimeIndex([dt.datetime(2022,1,1),dt.datetime(2023,1,1),dt.datetime(2024,1,1)])

DatetimeIndex(['2022-01-01', '2023-01-01', '2024-01-01'], dtype='datetime64[ns]', freq=None)

In [46]:
dt_index = pd.DatetimeIndex([pd.Timestamp(2022,1,1),pd.Timestamp(2023,1,1),pd.Timestamp(2024,1,1)])
dt_index

DatetimeIndex(['2022-01-01', '2023-01-01', '2024-01-01'], dtype='datetime64[ns]', freq=None)

In [47]:
pd.Series([1,2,3],index=dt_index)

2022-01-01    1
2023-01-01    2
2024-01-01    3
dtype: int64

In [48]:
# Date Range Function  D - Day
pd.date_range(start = '2023-05-01',end = '2023-05-31', freq= 'D')

DatetimeIndex(['2023-05-01', '2023-05-02', '2023-05-03', '2023-05-04',
               '2023-05-05', '2023-05-06', '2023-05-07', '2023-05-08',
               '2023-05-09', '2023-05-10', '2023-05-11', '2023-05-12',
               '2023-05-13', '2023-05-14', '2023-05-15', '2023-05-16',
               '2023-05-17', '2023-05-18', '2023-05-19', '2023-05-20',
               '2023-05-21', '2023-05-22', '2023-05-23', '2023-05-24',
               '2023-05-25', '2023-05-26', '2023-05-27', '2023-05-28',
               '2023-05-29', '2023-05-30', '2023-05-31'],
              dtype='datetime64[ns]', freq='D')

In [49]:
# To get the alternate date.   2D- Gap with 1 day
pd.date_range(start='2023-05-01', end = '2023-05-31', freq = '2D')

DatetimeIndex(['2023-05-01', '2023-05-03', '2023-05-05', '2023-05-07',
               '2023-05-09', '2023-05-11', '2023-05-13', '2023-05-15',
               '2023-05-17', '2023-05-19', '2023-05-21', '2023-05-23',
               '2023-05-25', '2023-05-27', '2023-05-29', '2023-05-31'],
              dtype='datetime64[ns]', freq='2D')

In [50]:
pd.date_range(start='2023-05-01', end = '2023-05-31', freq = '3D')

DatetimeIndex(['2023-05-01', '2023-05-04', '2023-05-07', '2023-05-10',
               '2023-05-13', '2023-05-16', '2023-05-19', '2023-05-22',
               '2023-05-25', '2023-05-28', '2023-05-31'],
              dtype='datetime64[ns]', freq='3D')

In [51]:
# B -- business days -- Mon - Fri
pd.date_range(start='2023-05-01', end = '2023-05-31', freq = 'B')

DatetimeIndex(['2023-05-01', '2023-05-02', '2023-05-03', '2023-05-04',
               '2023-05-05', '2023-05-08', '2023-05-09', '2023-05-10',
               '2023-05-11', '2023-05-12', '2023-05-15', '2023-05-16',
               '2023-05-17', '2023-05-18', '2023-05-19', '2023-05-22',
               '2023-05-23', '2023-05-24', '2023-05-25', '2023-05-26',
               '2023-05-29', '2023-05-30', '2023-05-31'],
              dtype='datetime64[ns]', freq='B')

In [52]:
# W - 1 week per day
print(pd.date_range(start='2023-05-01', end = '2023-05-31', freq = 'W'))
print(pd.date_range(start='2023-05-01', end = '2023-05-31', freq = 'W-FRI'))

DatetimeIndex(['2023-05-07', '2023-05-14', '2023-05-21', '2023-05-28'], dtype='datetime64[ns]', freq='W-SUN')
DatetimeIndex(['2023-05-05', '2023-05-12', '2023-05-19', '2023-05-26'], dtype='datetime64[ns]', freq='W-FRI')

In [53]:
# H - hourly Data factor -- It will give the hourly timestamp.
print(pd.date_range(start='2023-05-01', end='2023-05-31',freq='H'))
print("===========================================================\n")
print(pd.date_range(start='2023-05-01', end='2023-05-31',freq='6H'))

DatetimeIndex(['2023-05-01 00:00:00', '2023-05-01 01:00:00',
               '2023-05-01 02:00:00', '2023-05-01 03:00:00',
               '2023-05-01 04:00:00', '2023-05-01 05:00:00',
               '2023-05-01 06:00:00', '2023-05-01 07:00:00',
               '2023-05-01 08:00:00', '2023-05-01 09:00:00',
               ...
               '2023-05-30 15:00:00', '2023-05-30 16:00:00',
               '2023-05-30 17:00:00', '2023-05-30 18:00:00',
               '2023-05-30 19:00:00', '2023-05-30 20:00:00',
               '2023-05-30 21:00:00', '2023-05-30 22:00:00',
               '2023-05-30 23:00:00', '2023-05-31 00:00:00'],
              dtype='datetime64[ns]', length=721, freq='h')
===========================================================

DatetimeIndex(['2023-05-01 00:00:00', '2023-05-01 06:00:00',
               '2023-05-01 12:00:00', '2023-05-01 18:00:00',
               '2023-05-02 00:00:00', '2023-05-02 06:00:00',
               '2023-05-02 12:00:00', '2023-05-02 18:00:00',
               '2023-05-03 00:00:00', '2023-05-03 06:00:00',
               ...
               '2023-05-28 18:00:00', '2023-05-29 00:00:00',
               '2023-05-29 06:00:00', '2023-05-29 12:00:00',
               '2023-05-29 18:00:00', '2023-05-30 00:00:00',
               '2023-05-30 06:00:00', '2023-05-30 12:00:00',
               '2023-05-30 18:00:00', '2023-05-31 00:00:00'],
              dtype='datetime64[ns]', length=121, freq='6h')

C:\Users\sasha\AppData\Local\Temp\ipykernel_18444\2635264867.py:2: FutureWarning: 'H' is deprecated and will be removed in a future version, please use 'h' instead.
  print(pd.date_range(start='2023-05-01', end='2023-05-31',freq='H'))
C:\Users\sasha\AppData\Local\Temp\ipykernel_18444\2635264867.py:4: FutureWarning: 'H' is deprecated and will be removed in a future version, please use 'h' instead.
  print(pd.date_range(start='2023-05-01', end='2023-05-31',freq='6H'))

In [ ]:
# M - for month end. -- It will give the month end..
print(pd.date_range(start='2023-05-01', end='2023-05-31',freq='M'))

In [55]:
# MS - for month start -- it will give month start 
print(pd.date_range(start='2023-05-01', end='2023-05-31',freq='MS'))

DatetimeIndex(['2023-05-01'], dtype='datetime64[ns]', freq='MS')

In [54]:
# A - to get the year end -- 
print(pd.date_range(start='2023-05-01', end='2030-05-31',freq='A'))

DatetimeIndex(['2023-12-31', '2024-12-31', '2025-12-31', '2026-12-31',
               '2027-12-31', '2028-12-31', '2029-12-31'],
              dtype='datetime64[ns]', freq='YE-DEC')

C:\Users\sasha\AppData\Local\Temp\ipykernel_18444\3803988507.py:2: FutureWarning: 'A' is deprecated and will be removed in a future version, please use 'YE' instead.
  print(pd.date_range(start='2023-05-01', end='2030-05-31',freq='A'))

In [56]:
# AS -- to get the start date of every year.
print(pd.date_range(start='2023-05-01', end='2030-05-31',freq='AS'))

DatetimeIndex(['2024-01-01', '2025-01-01', '2026-01-01', '2027-01-01',
               '2028-01-01', '2029-01-01', '2030-01-01'],
              dtype='datetime64[ns]', freq='YS-JAN')

C:\Users\sasha\AppData\Local\Temp\ipykernel_18444\3730297710.py:2: FutureWarning: 'AS' is deprecated and will be removed in a future version, please use 'YS' instead.
  print(pd.date_range(start='2023-05-01', end='2030-05-31',freq='AS'))

In [57]:
# Using Period - No of Results.
print(pd.date_range(start='2023-01-01',periods=20,freq='D'))
print("====================================================\n")
print(pd.date_range(start='2023-01-01',periods=20,freq='H'))
print("====================================================\n")
print(pd.date_range(start='2023-01-01',periods=20,freq='M'))

DatetimeIndex(['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04',
               '2023-01-05', '2023-01-06', '2023-01-07', '2023-01-08',
               '2023-01-09', '2023-01-10', '2023-01-11', '2023-01-12',
               '2023-01-13', '2023-01-14', '2023-01-15', '2023-01-16',
               '2023-01-17', '2023-01-18', '2023-01-19', '2023-01-20'],
              dtype='datetime64[ns]', freq='D')
====================================================

DatetimeIndex(['2023-01-01 00:00:00', '2023-01-01 01:00:00',
               '2023-01-01 02:00:00', '2023-01-01 03:00:00',
               '2023-01-01 04:00:00', '2023-01-01 05:00:00',
               '2023-01-01 06:00:00', '2023-01-01 07:00:00',
               '2023-01-01 08:00:00', '2023-01-01 09:00:00',
               '2023-01-01 10:00:00', '2023-01-01 11:00:00',
               '2023-01-01 12:00:00', '2023-01-01 13:00:00',
               '2023-01-01 14:00:00', '2023-01-01 15:00:00',
               '2023-01-01 16:00:00', '2023-01-01 17:00:00',
               '2023-01-01 18:00:00', '2023-01-01 19:00:00'],
              dtype='datetime64[ns]', freq='h')
====================================================

DatetimeIndex(['2023-01-31', '2023-02-28', '2023-03-31', '2023-04-30',
               '2023-05-31', '2023-06-30', '2023-07-31', '2023-08-31',
               '2023-09-30', '2023-10-31', '2023-11-30', '2023-12-31',
               '2024-01-31', '2024-02-29', '2024-03-31', '2024-04-30',
               '2024-05-31', '2024-06-30', '2024-07-31', '2024-08-31'],
              dtype='datetime64[ns]', freq='ME')

C:\Users\sasha\AppData\Local\Temp\ipykernel_18444\2355031408.py:4: FutureWarning: 'H' is deprecated and will be removed in a future version, please use 'h' instead.
  print(pd.date_range(start='2023-01-01',periods=20,freq='H'))
C:\Users\sasha\AppData\Local\Temp\ipykernel_18444\2355031408.py:6: FutureWarning: 'M' is deprecated and will be removed in a future version, please use 'ME' instead.
  print(pd.date_range(start='2023-01-01',periods=20,freq='M'))

# to_datetime function
Convert the exisiting objects to pandas timestamp/DatetimeIndex Objects.

In [23]:
my_series = pd.Series(['2021-01-01','2022-01-01','2023-01-01'])
my_series

0    2021-01-01
1    2022-01-01
2    2023-01-01
dtype: object

In [24]:
time_obj = pd.to_datetime(my_series)

In [25]:
print(time_obj.dt.year)
print(time_obj.dt.month)
print(time_obj.dt.day)
print(time_obj.dt.month_name())
print(time_obj.dt.day_name())

0    2021
1    2022
2    2023
dtype: int32
0    1
1    1
2    1
dtype: int32
0    1
1    1
2    1
dtype: int32
0    January
1    January
2    January
dtype: object
0      Friday
1    Saturday
2      Sunday
dtype: object

In [26]:
# with Error 
s = pd.Series(['2021-01-01','2022-01-01','2023-130-01'])
pd.to_datetime(s,errors= 'coerce')

0   2021-01-01
1   2022-01-01
2          NaT
dtype: datetime64[ns]